* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE DATA PARAMETER
USING PDACUST1
LOCAL
USING CUSTV2
END-DEFINE
*
MOVE CUSTOMER-OBJ.IDENT TO CUSTOMER-V2.IDENT
MOVE CUSTOMER-OBJ.AGE TO CUSTOMER-V2.AGE
MOVE CUSTOMER-OBJ.FIRSTNAME(1:10) TO CUSTOMER-V2.FIRSTNAME(1:10)
MOVE CUSTOMER-OBJ.LASTNAME TO CUSTOMER-V2.LASTNAME
*
STORE RECORD IN FILE CUSTOMER-V2
*
*
END
