DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP
/* <Natural Source Header
1 CUSTOMER-VIEW VIEW OF CUSTOMER
  2 LASTNAME (A20)
  2 FIRSTNAME (A20/1:191)
  2 IDENT (B4)
  2 AGE (N3)
END-DEFINE
