* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA LOCAL
LOCAL USING CUSTV1
LOCAL 
1 FIRSTNAMEMASH (A30)
END-DEFINE
*
READ  CUSTOMER-VIEW BY ISN

COMPRESS FIRSTNAME(1) ',' FIRSTNAME(2) INTO FIRSTNAMEMASH

  DISPLAY *ISN FIRSTNAMEMASH LASTNAME AGE IDENT
END-READ
*
* noch was
END
